{
  "sku": "10781-105k",
  "title": "KETO CORE Extra Strength - Advanced Keto Booster for Weight Loss & Enhanced Focus - 60 Capsules",
  "slug": "keto-core-extra-strength-advanced-keto-booster-for-weight-loss-enhanced-focus-60-capsules",
  "descriptionHtml": "Achieve your weight loss goals with Success Chemistry® KETO CORE Extra Strength. This advanced keto supplement is expertly formulated to support healthy weight loss while enhancing mental focus and clarity. It boosts energy and metabolism, making it ideal for anyone following a ketogenic diet. Each potent capsule is designed to help maintain ketosis and optimize your body's fat-burning potential.\r\r\n\r\r\n<strong>Key Benefits of KETO CORE Extra Strength:</strong>\r\r\n<ul>\r\r\n \t<li><strong>Speeds Fat Metabolism:</strong> Accelerates fat metabolism for efficient fat burning, helping you reach your weight loss targets faster.</li>\r\r\n \t<li><strong>Supports Energy Levels:</strong> Boosts energy, keeping you active and alert throughout the day.</li>\r\r\n \t<li><strong>Enhances Mental Focus &amp; Clarity:</strong> Improves cognitive function, helping you stay focused and clear-headed.</li>\r\r\n \t<li><strong>Weight Management Support:</strong> Comprehensive support for maintaining a healthy weight.</li>\r\r\n \t<li><strong>Ketogenic Diet Friendly:</strong> Complements a ketogenic diet, maximizing fat-burning potential.</li>\r\r\n</ul>\r\r\n<strong>Ingredients:</strong>\r\r\n<ul>\r\r\n \t<li><strong>Green Coffee Bean (50% extract) - 130 mg:</strong> Contains chlorogenic acids that support weight loss and reduce carbohydrate absorption.</li>\r\r\n \t<li><strong>Raspberry Ketone - 130 mg:</strong> Known for its fat-burning properties, it helps increase fat breakdown and boosts metabolism.</li>\r\r\n \t<li><strong>Garcinia Cambogia (50% HCA) - 130 mg:</strong> Suppresses appetite and prevents fat storage.</li>\r\r\n \t<li><strong>Caffeine Anhydrous - 130 mg:</strong> Enhances energy levels and alertness, supporting weight loss efforts.</li>\r\r\n \t<li><strong>Green Tea (leaf) - 130 mg:</strong> Rich in antioxidants, it supports metabolism and fat oxidation.</li>\r\r\n</ul>\r\r\nExperience the benefits of KETO CORE Extra Strength and unlock your potential for a healthier, more active lifestyle!",
  "shortDescriptionHtml": "Achieve your weight loss goals with Success Chemistry¬Æ KETO CORE Extra Strength. Our advanced keto booster enhances fat metabolism, boosts energy, and supports mental clarity. Perfect for a ketogenic diet. 60 capsules per bottle.",
  "suggestedUse": null,
  "upc": "651074168624",
  "gtin": "651074168624",
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 1 Capsule\nServings Per Container: 60\n\nAmount Per Serving / %DV\nKeto Blend 650 mg **\nRaspberry Ketone (98%), Green Tea (Camellia sinensis) (leaf) (98% polyphenols, 75% catechins, 45% EGCG, 6% Caffeine) Caffeine Anhydrous (98%), Green Coffee Bean (Coffea robusta) (seed) (50% Extract), Garcinia Cambogia (fruit) (50% Extract)\n\n** Daily Value (DV) not established\n\nInactive Ingredients: Cellulose (Vegetable Capsule).\nCONTAINS CAFFEINE\nDistributed by: successchemistry.com"
}