{
  "sku": "10814-123",
  "title": "Dragon FIRE E-Sports Supplement - Boost Energy, Focus & Endurance for Gamers - 60 Capsules",
  "slug": "dragon-fire-e-sports-supplement-boost-energy-focus-endurance-for-gamers-60-capsules",
  "descriptionHtml": "<h2><span style=\"color: #ff0000;\">Key Benefits of Dragon FIRE Focus Formula</span></h2>\r\r\n<strong>Enhances Gaming Performance:</strong> Supports energy, focus, and endurance for peak performance during long gaming sessions.\r\r\n\r\r\n<strong>Powerful Energy Boost:</strong> Caffeine Anhydrous provides rapid energy and alertness, while Kola Nut enhances mental focus.\r\r\n\r\r\n<strong>Cognitive Support:</strong> Phenylethylamine HCl improves mood and cognitive function, keeping you engaged in the game.\r\r\n\r\r\n<strong>Endurance Support:</strong> L-Carnitine aids energy production, reducing fatigue, while Raspberry Ketones and Yohimbe Bark promote fat loss.\r\r\n\r\r\n<strong>Antioxidant Benefits:</strong> Green Tea Extract supports metabolism and overall health, maintaining energy levels.\r\r\n<h3></h3>\r\r\n<h2><span style=\"color: #ff0000;\">Why Choose Dragon FIRE Focus Formula?</span></h2>\r\r\n<strong>Enhanced Gaming Performance:</strong> Specially formulated to support mental clarity, focus, and sustained energy, Dragon FIRE ensures you stay sharp and responsive during intense gaming sessions.\r\r\n\r\r\n<strong>Convenient Dosage:</strong> Each bottle contains 60 easy-to-swallow capsules, providing a one-month supply when taken as directed.\r\r\n\r\r\n<strong>Safe and Natural Ingredients:</strong> Made from high-quality, natural ingredients, ensuring a safe and effective supplement for gamers.\r\r\n\r\r\n<strong>Doctor Recommended:</strong> Trusted by healthcare professionals for its effectiveness in enhancing gaming performance.\r\r\n\r\r\n<strong>Scientifically Backed Ingredients:</strong>\r\r\nOur formula includes clinically studied ingredients that have been shown to enhance cognitive function, energy levels, and physical endurance.",
  "shortDescriptionHtml": "Enhance your gaming performance with Dragon FIRE Focus Formula by Success Chemistry. Our advanced e-sports supplement boosts focus, energy, and endurance with ingredients like caffeine anhydrous, Phenylethylamine HCl, and green tea extract. Dominate the game now!",
  "suggestedUse": null,
  "upc": null,
  "gtin": null,
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 1 Capsule\nServings Per Container: 60\n\nAmount Per Serving / %DV\nEnergy Blend 450 mg **\nCaffeine, Phenylethylamine HCl, Glucomannan, Fursultiamine, L-Tyrosine\nThermogenic Focus Blend 40 mg **\nGreen Tea Extract (min. 50% EGCG, min. 98% Polyphenols) (leaf), Raspberry Ketones, Yohimbe bark\nEndurance Blend 7 mg **\nKola Nut, L-Carnitine\n\n** Daily Value (DV) not Established\n\nOther Ingredients: Gelatin, Rice Flour, Magnesium Stearate, Silicon Dioxide, FD&C Red #40 & Titanium Dioxide.\nDistributed by: successchemistry.com"
}