{
  "sku": "14189-717",
  "title": "Multi-Collagen Capsules with Types I, II, III, V, and X Collagen by Success Chemistry - 90 Capsules",
  "slug": "multi-collagen-capsules-with-types-i-ii-iii-v-and-x-collagen-by-success-chemistry-90-capsules",
  "descriptionHtml": "&nbsp;\r\r\n\r\r\nEnhance your skin, hair, nails, and joints with <strong>Multi-Collagen Capsules by Success Chemistry</strong>. This advanced formula features Types I, II, III, V, and X Collagen, delivering comprehensive support for overall health and beauty. Collagen is crucial for maintaining skin elasticity, joint flexibility, and strong hair and nails. Our supplement helps reduce wrinkles, improve skin hydration, and promote joint comfort.\r\r\n\r\r\n<strong>Key Benefits:</strong>\r\r\n<ul>\r\r\n \t<li><strong>Enhances Skin Elasticity:</strong> Reduces wrinkles and improves skin elasticity.</li>\r\r\n \t<li><strong>Promotes Joint Health:</strong> Supports flexibility and comfort for overall joint health.</li>\r\r\n \t<li><strong>Strengthens Hair and Nails:</strong> Maintains strong hair and nails, reducing brittleness.</li>\r\r\n \t<li><strong>Improves Skin Hydration:</strong> Retains moisture for a healthy glow.</li>\r\r\n \t<li><strong>Comprehensive Support:</strong> Blends five collagen types for holistic health benefits.</li>\r\r\n</ul>\r\r\n<strong>Ingredients:</strong>\r\r\n<ul>\r\r\n \t<li><strong>Bovine Collagen Peptides:</strong> Types I and III for skin, hair, and nails.</li>\r\r\n \t<li><strong>Hydrolyzed Chicken Collagen Peptides:</strong> Type II for joint health.</li>\r\r\n \t<li><strong>Marine Collagen Peptides:</strong> Type I for skin elasticity.</li>\r\r\n \t<li><strong>Eggshell Membrane Collagen Peptides:</strong> Type V for connective tissues.</li>\r\r\n \t<li><strong>Avian Sternum Collagen Peptides:</strong> Type X for joint mobility.</li>\r\r\n</ul>\r\r\n<strong>Why Choose Multi-Collagen Capsules?</strong>\r\r\n<ul>\r\r\n \t<li><strong>High-Quality Collagen:</strong> Premium peptides from diverse sources.</li>\r\r\n \t<li><strong>Natural and Effective:</strong> Free from artificial additives and allergens.</li>\r\r\n \t<li><strong>Convenient:</strong> 90 easy-to-swallow capsules for a one-month supply.</li>\r\r\n</ul>\r\r\n<strong>Elevate your natural beauty and vitality</strong> with Success Chemistry’s Multi-Collagen Capsules!",
  "shortDescriptionHtml": "Support your skin, hair, nails, and joints with Success Chemistry's Multi-Collagen Capsules. Our formula contains Types I, II, III, V, and X Collagen for comprehensive health and beauty support. 90 capsules per bottle.",
  "suggestedUse": null,
  "upc": "651074168471",
  "gtin": "651074168471",
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 2 Capsules\nServings Per Container: 30\n\nAmount Per Serving / %DV\nPremium Collagen Protein Complex 1000 mg **\nBovine Collagen Peptides, Hydrolyzed Chicken Collagen Peptides, Pure Hydrolyzed Marine Collagen Peptides, Eggshell Membrane Collagen Peptides, Avian Sternum Collagen Peptides.\n\n** Daily Value (DV) not established\n\nInactive Ingredients: Gelatin Capsules.\nContains: Egg, Fish.\nContains no added: Shellfish, Milk, Tree Nuts, Wheat, Peanuts, Soy.\nDistributed by: successchemistry.com"
}