{
  "sku": "20645-306",
  "title": "Lung and Body Immune Support with Echinacea and Probiotics - Total Body Respiratory Vitality and Overall Health Supplement - Enhanced with Elderberry, Vitamin C, and Probiotics for Immune Boost and Digestive Health - 60 Capsules",
  "slug": "lung-and-body-immune-support-with-echinacea-and-probiotics-total-body-respiratory-vitality-and-overall-health-supplement-enhanced-with-elderberry-vitamin-c-and-probiotics-for-immune-boost-and-di",
  "descriptionHtml": "Boost your respiratory vitality and overall health with New Lung® Lung and Body Immune Support. This advanced dietary supplement is expertly formulated with a powerful blend of vitamins, herbs, and probiotics to support lung function, enhance immune response, and promote overall well-being. Our unique formula includes Elderberry, Echinacea, Vitamin C, and Probiotics to provide comprehensive health support.\r\r\n<h3><span style=\"font-family: helvetica, arial, sans-serif; color: #000080;\"><strong>Key Ingredients and Their Benefits:</strong></span></h3>\r\r\n<ul>\r\r\n \t<li><strong>Vitamin C (Ascorbic Acid) - 180mg (200% DV):</strong> A potent antioxidant that supports immune function, Vitamin C helps protect against free radicals and enhances the body’s natural defenses.</li>\r\r\n \t<li><strong>Vitamin E (DL-Alpha Tocopheryl Acetate) - 20mg (133% DV):</strong> An essential nutrient that supports immune health and protects cells from oxidative damage.</li>\r\r\n \t<li><strong>Vitamin B6 (Pyridoxine HCl) - 3.4mg (200% DV):</strong> Vital for immune function, Vitamin B6 supports biochemical reactions in the immune system and helps maintain overall health.</li>\r\r\n \t<li><strong>Zinc (Zinc Oxide) - 16mg (146% DV):</strong> Crucial for immune function, Zinc helps maintain the integrity of the immune system and supports the body’s ability to fight off pathogens.</li>\r\r\n \t<li><strong>L-Glutamine HCl - 200mg:</strong> An amino acid that supports immune function and gut health, L-Glutamine is essential for maintaining the integrity of the intestinal barrier.</li>\r\r\n \t<li><strong>European Elderberry Extract (Sambucus nigra) - 300mg:</strong> Known for its immune-boosting properties, Elderberry helps support respiratory health and enhances immune response.</li>\r\r\n \t<li><strong>Echinacea Purpurea Powder - 200mg:</strong> A powerful herb that supports the immune system and helps the body combat infections.</li>\r\r\n \t<li><strong>Garlic Powder (Allium sativum) - 100mg:</strong> Known for its immune-boosting and anti-inflammatory properties, garlic helps protect against respiratory infections and supports overall health.</li>\r\r\n \t<li><strong>Turmeric 95% Curcuminoids (Curcuma longa) - 100mg:</strong> A potent anti-inflammatory and antioxidant, turmeric supports immune function and promotes overall well-being.</li>\r\r\n \t<li><strong>Lactobacillus Acidophilus - 4.8 Billion CFU:</strong> A beneficial probiotic that supports gut health, enhances immune function, and promotes digestive health.</li>\r\r\n</ul>\r\r\n<h3><span style=\"font-family: helvetica, arial, sans-serif; color: #000080;\"><strong>Why Choose New Lung® Lung and Body Immune Support?</strong></span></h3>\r\r\n<ul>\r\r\n \t<li><strong>Comprehensive Respiratory and Immune Support:</strong> Our formula is designed to support lung health, boost immune function, and promote overall well-being.</li>\r\r\n \t<li><strong>Powerful Antioxidants and Anti-inflammatories:</strong> Ingredients like Vitamin C, Vitamin E, and Turmeric provide powerful antioxidant and anti-inflammatory benefits.</li>\r\r\n \t<li><strong>Immune-Boosting Herbs:</strong> Elderberry, Echinacea, and Garlic are known for their ability to enhance immune response and protect against infections.</li>\r\r\n \t<li><strong>Probiotics for Digestive Health:</strong> Lactobacillus Acidophilus supports gut health, which is essential for maintaining a strong immune system.</li>\r\r\n \t<li><strong>Natural and Safe:</strong> Made with high-quality, natural ingredients, our supplement is free from artificial additives, preservatives, and common allergens.</li>\r\r\n</ul>\r\r\n<span style=\"color: #000080; font-family: helvetica, arial, sans-serif;\"><strong>Support Your Respiratory and Immune Health Naturally:</strong></span> Invest in your health with New Lung® Lung and Body Immune Support with Echinacea and Probiotics. Our advanced formula provides the essential nutrients and herbal support your body needs for optimal lung function, immune response, and overall well-being. Experience the benefits of comprehensive health support with our expertly crafted supplement.",
  "shortDescriptionHtml": "Support your respiratory and immune health with New Lung¬Æ Lung and Body Immune Support. Our advanced formula with Echinacea, Elderberry, and Probiotics promotes lung function, boosts immunity, and enhances overall well-being. 60 capsules per bottle.",
  "suggestedUse": null,
  "upc": null,
  "gtin": null,
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 2 Capsules\nServings Per Container: 30\n\nAmount Per Serving / %DV\nVitamin C (as Ascorbic acid) 180 mg 200%\nVitamin E (DL-Alpha tocopheryl acetate) 20 mg 133%\nVitamin B6 (as Pyridoxine HCl) 3.4 mg 200%\nZinc (as Zinc oxide) 16 mg 146%\nL-Glutamine HCl 200 mg **\nEuropean Elderberry Extract (Sambucus nigra) (fruit) 300 mg **\nEchinacea Purpurea Powder (Echinacea purpurea) (aerial) 200 mg **\nGarlic Powder (Allium sativum) (bulb) 100 mg **\nTurmeric 95% Curcuminoids (Curcuma longa) (root) 100 mg **\nLactobacillus Acidophilus 4.8 Billion CFU **\n\n** Daily Value (DV) not established.\n\nOther Ingredients: Hypromellose (vegetable capsule).\nDistributed by: successchemistry.com"
}