{
  "sku": "3008-221",
  "title": "Eyelash Growth and Eyebrow Dietary Supplement by Success Chemistry - Achieve Longer, Fuller Lashes and Thicker Eyebrows with Natural Ingredients - 500mg Plus Per Serving - 60 Capsules",
  "slug": "eyelash-growth-and-eyebrow-dietary-supplement-by-success-chemistry-achieve-longer-fuller-lashes-and-thicker-eyebrows-with-natural-ingredients-500mg-plus-per-serving-60-capsules",
  "descriptionHtml": "Transform your lashes and brows with Cosmic Icon® Eyelash Growth and Eyebrow Dietary Supplement by Success Chemistry. This advanced dietary supplement is crafted to naturally stimulate hair follicles, encouraging faster growth and stronger, healthier eyelashes and eyebrows. Each serving delivers 500mg plus of a potent blend of natural ingredients, ensuring optimal results.\r\r\n<h3><span style=\"font-family: helvetica, arial, sans-serif; color: #000080;\">Key Ingredients and Their Benefits</span></h3>\r\r\n<ul>\r\r\n \t<li><strong>P-amino Benzoic Acid (PABA):</strong> Known for supporting natural hair color and preventing hair loss, PABA enhances overall hair follicle health and promotes robust growth.</li>\r\r\n \t<li><strong>Horsetail Extract (Equisetum arvense L.):</strong> Rich in silica, this extract strengthens hair strands, reduces breakage, and enhances shine, fostering healthier growth.</li>\r\r\n \t<li><strong>Fo-Ti (Polygonum multiflorum):</strong> A traditional Chinese herb that nourishes hair follicles, promoting hair growth and preventing thinning.</li>\r\r\n \t<li><strong>Bamboo Extract (Phyllostachys viridis):</strong> A silica-rich extract that supports hair strength and elasticity, reducing breakage and encouraging thicker growth.</li>\r\r\n \t<li><strong>Stinging Nettle (Urtica dioica L.):</strong> Known for its anti-inflammatory properties, stinging nettle reduces scalp irritation, promoting healthier hair follicles.</li>\r\r\n \t<li><strong>Chinese Peony (Paeonia lactiflora):</strong> Enhances blood circulation, delivering essential nutrients to hair follicles and promoting healthy growth.</li>\r\r\n \t<li><strong>Spirulina (Arthrospira platensis):</strong> Packed with proteins, vitamins, and minerals, spirulina nourishes hair follicles, supporting overall hair health and growth.</li>\r\r\n \t<li><strong>Saw Palmetto (Serenoa repens):</strong> Helps block DHT, a hormone linked to hair loss, encouraging fuller and thicker growth.</li>\r\r\n \t<li><strong>Plant Sterols (from Soy Bean):</strong> Support healthy hair growth by improving scalp health and providing essential nutrients to hair follicles.</li>\r\r\n \t<li><strong>Alfalfa (Medicago sativa):</strong> Rich in vitamins and minerals, alfalfa supports overall hair health and stronger growth.</li>\r\r\n \t<li><strong>Barley Grass (Hordeum vulgare L.):</strong> Contains essential nutrients that support hair growth, strength, and texture.</li>\r\r\n</ul>\r\r\n&nbsp;\r\r\n<h3><span style=\"font-family: helvetica, arial, sans-serif; color: #000080;\">Why Choose Cosmic Icon® Eyelash Growth and Eyebrow Dietary Supplement?</span></h3>\r\r\n<ul>\r\r\n \t<li><strong>Promotes Hair Growth:</strong> Specially formulated to stimulate hair follicles for longer, fuller eyelashes and thicker eyebrows.</li>\r\r\n \t<li><strong>Strengthens and Nourishes:</strong> A blend of biotin, peptides, and botanical extracts strengthens hair from the root, reducing breakage and enhancing overall hair health.</li>\r\r\n \t<li><strong>Convenient Capsule Form:</strong> Easy-to-swallow capsules provide the full benefits of our powerful formula in each serving.</li>\r\r\n \t<li><strong>Safe and Natural:</strong> Made from natural ingredients, free from harsh chemicals, and suitable for all hair and skin types.</li>\r\r\n</ul>\r\r\n<h3><span style=\"font-family: helvetica, arial, sans-serif; color: #000080;\">Achieve Beautiful Lashes and Brows Naturally</span></h3>\r\r\nElevate your beauty routine with Cosmic Icon® Eyelash Growth and Eyebrow Dietary Supplement by Success Chemistry. Our advanced formula harnesses the power of natural ingredients to promote longer, fuller lashes and thicker brows. Experience the confidence of beautiful, voluminous lashes and brows with our expertly crafted supplement.",
  "shortDescriptionHtml": "Achieve longer, fuller lashes and thicker brows with Cosmic Icon Eyelash Growth and Eyebrow Dietary Supplement. Our 30-day supply provides 500mg plus per serving of natural ingredients to promote stronger, healthier hair. Enhance your beauty routine naturally.",
  "suggestedUse": null,
  "upc": "635635749798",
  "gtin": "635635749798",
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 2 Capsules\nServings Per Container: 30\n\nAmount Per Serving / %DV\nVitamin A (as Beta-carotene) 120 mcg RAE 13%\nVitamin C (as Ascorbic acid) 120 mg 133%\nCalcium (as Calcium carbonate) 80 mg 6%\nIron (as Ferrous fumarate) 14.5 mg 81%\nVitamin D3 (as Cholecalciferol) 20 mcg 100%\nVitamin E (as DL-Alpha tocopheryl acetate) 14 mg 93%\nVitamin B1 (as Thiamine mononitrate) 6 mg 500%\nVitamin B6 (as Pyridoxine HCl) 8 mg 471%\nFolate 1,467 mcg DFE 367% (880 mcg Folic Acid)\nVitamin B12 (as Cyanocobalamin) 12 mcg 500%\nBiotin 600 mcg 2,000%\nVitamin B5 (as D-Calcium pantothenate) 30 mg 600%\nMagnesium (as Magnesium Oxide) 120 mg 29%\nZinc (as Zinc Oxide) 7 mg 64%\nManganese (as Manganese amino acid chelate) 4 mg 174%\nPotassium (as Potassium gluconate) 12 mg <1%\nProprietary Blend: 409 mg **\nPABA, L-Tyrosine HCL, Horsetail extract (Equisetum arvense L.) (Whole herb), Fo-Ti (Polygonum multiflorum) (root), Bamboo extract (Phyllostachys viridis) (leaf), Nettle root (Urtica dioica L.), Peony (Paeonia lactiflora) (root), Spirulina (Arthrospira platensis) (whole plant), Saw palmetto (Serenoa repens) (fruit), Plant sterols (Glycine max) (leaf), Alfalfa (Medicago sativa) (herb), Barley grass (Hordeum vulgare L.) (aerial)\n\n** Daily Value (DV) Not Established\n\nInactive Ingredients: Cellulose (Vegetable Capsule), Rice Flour, Magnesium stearate, Silicon dioxide. Contains: Soy.\nDistributed by: successchemistry.com"
}