{
  "sku": "31347-405-1",
  "title": "Maca Force Organic Root Supplement with Red, Black, and Yellow Maca by Success Chemistry - 60 Capsules",
  "slug": "maca-force-organic-root-supplement-with-red-black-and-yellow-maca-by-success-chemistry-60-capsules",
  "descriptionHtml": "Boost your energy and vitality with <strong>Maca Force Organic Root Supplement</strong> by Success Chemistry. This unique blend combines red, black, and yellow Maca roots, each offering distinct health benefits. Maca is a powerful adaptogen known for enhancing energy, stamina, and libido, making it an ideal choice for those looking to improve overall well-being.\r\r\n\r\r\n<strong>Key Benefits:</strong>\r\r\n<ul>\r\r\n \t<li><strong>Enhances Energy and Stamina:</strong> Naturally boosts energy levels and enhances stamina.</li>\r\r\n \t<li><strong>Supports Hormonal Balance:</strong> Helps regulate hormones, improving mood and reducing menopause symptoms.</li>\r\r\n \t<li><strong>Improves Libido:</strong> Known for its aphrodisiac properties, enhances sexual health in both men and women.</li>\r\r\n \t<li><strong>Boosts Performance:</strong> Supports better physical and mental performance by reducing fatigue.</li>\r\r\n \t<li><strong>Enhanced Absorption:</strong> Black Pepper extract improves the absorption and bioavailability of Maca.</li>\r\r\n</ul>\r\r\n<strong>Ingredients:</strong>\r\r\n<ul>\r\r\n \t<li><strong>Organic Black Maca Root (1000mg):</strong> Enhances stamina and mental focus.</li>\r\r\n \t<li><strong>Organic Red Maca Root (250mg):</strong> Supports hormonal balance and mood.</li>\r\r\n \t<li><strong>Organic Yellow Maca Root (250mg):</strong> Promotes overall vitality and well-being.</li>\r\r\n \t<li><strong>Black Pepper (5mg):</strong> Enhances nutrient absorption for maximum benefits.</li>\r\r\n</ul>\r\r\n<strong>Elevate your energy and hormonal balance with Success Chemistry's Maca Force Organic Root Supplement!</strong>\r\r\n\r\r\n&nbsp;",
  "shortDescriptionHtml": "Boost your energy, stamina, and hormonal balance with Success Chemistry's Maca Force Organic Root Supplement. Our unique blend of red, black, and yellow Maca roots, enhanced with Black Pepper, supports overall well-being. 60 capsules per bottle.",
  "suggestedUse": null,
  "upc": "783325396040",
  "gtin": "783325396040",
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 2 Capsules\nServings Per Container: 30\n\nAmount Per Serving / %DV\nOrganic Maca Root (Black) (Lepidium meyenii) 1000 mg **\nOrganic Maca Root (Red) (Lepidium meyenii) 250 mg **\nOrganic Maca Root (Yellow) (Lepidium meyenii) 250 mg **\nBlack Pepper (Piper Nigrum) (Fruit) 5 mg **\n\n** Daily Value (DV) not established\n\nOther Ingredients: Cellulose (Vegetable Capsule), Vegetable Stearate.\nDistributed by: successchemistry.com"
}