{
  "sku": "4872-221",
  "title": "Captain Long Beard Rapid Beard Growth Formula - Powerful Blend with PABA, Horsetail Extract, Fo-Ti, Bamboo Extract, Stinging Nettle, Chinese Peony, Spirulina, Saw Palmetto, Plant Sterols, Alfalfa, and Barley - 60 Capsules",
  "slug": "captain-long-beard-rapid-beard-growth-formula-powerful-blend-with-paba-horsetail-extract-fo-ti-bamboo-extract-stinging-nettle-chinese-peony-spirulina-saw-palmetto-plant-sterols-alfalfa-and",
  "descriptionHtml": "<h3><span style=\"color: #000080; font-family: helvetica, arial, sans-serif;\">Achieve the Beard of Your Dreams with Captain Long Beard Rapid Beard Growth Formula</span></h3>\r\r\nAchieve the beard of your dreams with Captain Long Beard Rapid Beard Growth Formula. This powerful supplement is meticulously crafted to support and enhance beard growth, ensuring you get a fuller, thicker, and healthier beard. Our unique blend of natural ingredients works synergistically to promote hair growth, improve hair strength, and provide essential nutrients for optimal beard health.\r\r\n<h4><span style=\"color: #000080;\">Key Ingredients and Their Benefits</span></h4>\r\r\n<strong>P-amino Benzoic Acid (PABA):</strong>\r\r\nPABA is known for its role in preventing hair loss and maintaining natural hair color. It supports the overall health of hair follicles, promoting robust beard growth.\r\r\n\r\r\n<strong>Horsetail Extract (Equisetum arvense L.):</strong>\r\r\nRich in silica, horsetail extract strengthens hair strands, reduces breakage, and enhances shine. It supports the structural integrity of hair, promoting healthier beard growth.\r\r\n\r\r\n<strong>Fo-Ti (Polygonum multiflorum):</strong>\r\r\nA traditional Chinese herb used for centuries to promote hair growth and prevent hair thinning. Fo-Ti nourishes hair follicles and enhances hair density.\r\r\n\r\r\n<strong>Bamboo Extract (Phyllostachys viridis):</strong>\r\r\nBamboo extract is a rich source of silica, which supports hair strength and elasticity. It helps reduce hair breakage and promotes thicker beard growth.\r\r\n\r\r\n<strong>Stinging Nettle (Urtica dioica L.):</strong>\r\r\nKnown for its anti-inflammatory properties, stinging nettle helps reduce scalp irritation and promotes healthier hair follicles.\r\r\n\r\r\n<strong>Chinese Peony (Paeonia lactiflora):</strong>\r\r\nChinese Peony root supports blood circulation, delivering essential nutrients to hair follicles and promoting healthy beard growth.\r\r\n\r\r\n<strong>Spirulina (Arthrospira platensis):</strong>\r\r\nSpirulina is packed with proteins, vitamins, and minerals that nourish hair follicles, enhancing overall beard health and promoting growth.\r\r\n\r\r\n<strong>Saw Palmetto (Serenoa repens):</strong>\r\r\nSaw palmetto helps block DHT, a hormone that contributes to hair loss, promoting fuller and thicker beard growth.\r\r\n\r\r\n<strong>Alfalfa (Medicago sativa):</strong>\r\r\nRich in vitamins and minerals, alfalfa supports overall hair health and promotes stronger hair growth.\r\r\n\r\r\n<strong>Barley:</strong>\r\r\nBarley contains essential nutrients that support hair growth and improve hair strength and texture.\r\r\n<h4><span style=\"color: #000080; font-family: helvetica, arial, sans-serif;\">Why Choose Captain Long Beard Rapid Beard Growth Formula?</span></h4>\r\r\n<strong>Advanced Beard Growth:</strong>\r\r\nOur formula is designed to target multiple aspects of beard growth, ensuring you achieve a fuller, thicker, and healthier beard.\r\r\n\r\r\n<strong>Natural Ingredients:</strong>\r\r\nWe use only high-quality, natural ingredients that are known for their effectiveness in promoting hair growth and health.\r\r\n\r\r\n<strong>Scientifically Backed:</strong>\r\r\nOur blend includes ingredients that are supported by scientific research and traditional use for promoting hair growth and overall hair health.\r\r\n\r\r\n<strong>Convenient and Effective:</strong>\r\r\nEach bottle contains 60 easy-to-swallow capsules, providing a one-month supply when taken as directed.\r\r\n<h4><span style=\"color: #000080; font-family: helvetica, arial, sans-serif;\">Grow Your Beard with Confidence</span></h4>\r\r\nUnlock the potential of your beard with Captain Long Beard Rapid Beard Growth Formula. Our powerful blend of natural ingredients supports healthy, robust beard growth, giving you the confidence to sport the beard you’ve always wanted. Trust Captain Long Beard to deliver the results you need for a fuller, thicker, and healthier beard.",
  "shortDescriptionHtml": "Achieve a fuller, thicker beard with Captain Long Beard Rapid Beard Growth Formula. Our powerful blend of PABA, horsetail extract, Fo-Ti, bamboo extract, and more supports robust beard growth and overall beard health. 60 capsules per bottle.",
  "suggestedUse": null,
  "upc": null,
  "gtin": null,
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 2 Capsules\nServings Per Container: 30\n\nAmount Per Serving / %DV\nVitamin A (as Beta-carotene) 120 mcg RAE 13%\nVitamin C (as Ascorbic acid) 120 mg 133%\nCalcium (as Calcium carbonate) 80 mg 6%\nIron (as Ferrous fumarate) 14.5 mg 81%\nVitamin D3 (as Cholecalciferol) 20 mcg 100%\nVitamin E (as DL-Alpha tocopheryl acetate) 14 mg 93%\nVitamin B1 (as Thiamine mononitrate) 6 mg 500%\nVitamin B6 (as Pyridoxine HCL) 8 mg 471%\nFolate 1,467 mcg DFE 367% (880 mcg Folic Acid)\nVitamin B12 (as Cyanocobalamin) 12 mcg 500%\nBiotin 600 mcg 2,000%\nVitamin B5 (as D-Calcium pantothenate) 30 mg 600%\nMagnesium (as Magnesium Oxide) 120 mg 29%\nZinc (as Zinc Oxide) 7 mg 64%\nManganese (as Manganese amino acid chelate) 4 mg 174%\nPotassium (as Potassium gluconate) 12 mg <1%\nProprietary Blend: 409 mg **\nPABA, L-Tyrosine HCL, Horsetail extract (Equisetum arvense L.) (Whole herb), Fo-Ti (Polygonum multiflorum) (root), Bamboo extract (Phyllostachys viridis) (leaf), Nettle root (Urtica dioica L.), Peony (Paeonia lactiflora) (root), Spirulina (Arthrospira platensis) (whole plant), Saw palmetto (Serenoa repens) (fruit), Plant sterols (Glycine max) (seed), Alfalfa (Medicago sativa) (herb), Barley grass (Hordeum vulgare L.) (aerial)\n\n** Daily Value (DV) Not Established\n\nInactive Ingredients: Cellulose (Vegetable Capsule), Rice Flour, Magnesium stearate, Silicon dioxide. Contains: Soy\nDistributed by: successchemistry.com"
}