{
  "sku": "1077-810",
  "title": "New Liver - Liver Detox & Cleanse Supplement | Advanced Liver Support with Milk Thistle, Artichoke, Dandelion | Fat Metabolizer & Detoxification Formula - 60 Capsules",
  "slug": "new-liver-liver-detox-fat-metabolizer",
  "descriptionHtml": "<h2><span style=\"color: #000080; font-family: helvetica, arial, sans-serif;\"><strong>New Liver - Advanced Liver Detox & Fat Metabolism Support</strong></span></h2>\r\n<p>Support your liver health with <strong>New Liver</strong>, a comprehensive liver detox and cleanse supplement formulated to promote optimal liver function, detoxification, and fat metabolism. Our powerful blend of herbs and nutrients helps protect liver cells, support natural detoxification processes, and enhance metabolic function.</p>\r\n<h3><span style=\"color: #000080;\"><strong>Key Benefits</strong></span></h3>\r\n<ul>\r\n<li><strong>Liver Detoxification:</strong> Milk Thistle (200mg) with silymarin supports liver cell regeneration and protects against toxins</li>\r\n<li><strong>Fat Metabolism Support:</strong> Choline and specialized herbs help metabolize fats and support healthy liver function</li>\r\n<li><strong>Antioxidant Protection:</strong> Powerful antioxidants protect liver cells from oxidative stress and free radical damage</li>\r\n<li><strong>Digestive Health:</strong> Artichoke, Dandelion, and Chicory Root support bile production and healthy digestion</li>\r\n<li><strong>Natural Cleanse:</strong> Chanca Piedra and herbal blend support kidney and liver cleansing</li>\r\n<li><strong>Overall Wellness:</strong> Comprehensive formula supports energy, vitality, and overall health</li>\r\n</ul>\r\n<h3><span style=\"color: #000080;\"><strong>Powerful Liver-Supporting Ingredients</strong></span></h3>\r\n<ul>\r\n<li><strong>Milk Thistle Extract (200mg):</strong> Gold standard for liver support, contains silymarin to protect and regenerate liver cells</li>\r\n<li><strong>Artichoke Extract (50mg):</strong> Supports bile production and liver detoxification</li>\r\n<li><strong>Dandelion Root (50mg):</strong> Natural diuretic that supports liver and kidney function</li>\r\n<li><strong>Chanca Piedra Extract (50mg):</strong> Traditional herb for liver and kidney cleansing</li>\r\n<li><strong>Beetroot (50mg):</strong> Rich in antioxidants and supports liver detoxification</li>\r\n<li><strong>Chicory Root (50mg):</strong> Supports digestive health and liver function</li>\r\n<li><strong>Zinc (30mg):</strong> Essential mineral for liver enzyme function and immune support</li>\r\n<li><strong>Turmeric:</strong> Powerful anti-inflammatory that supports liver health</li>\r\n<li><strong>Berberine HCL:</strong> Supports metabolic health and liver function</li>\r\n<li><strong>Ginger Root:</strong> Anti-inflammatory that aids digestion and liver health</li>\r\n</ul>\r\n<h3><span style=\"color: #000080;\"><strong>Who Should Use New Liver?</strong></span></h3>\r\n<p>Ideal for individuals seeking:</p>\r\n<ul>\r\n<li>Liver detoxification and cleansing support</li>\r\n<li>Enhanced fat metabolism</li>\r\n<li>Protection from environmental toxins</li>\r\n<li>Digestive health support</li>\r\n<li>Overall liver wellness maintenance</li>\r\n<li>Post-alcohol consumption liver support</li>\r\n</ul>\r\n<p><strong>Suggested Use:</strong> Take 2 veggie capsules daily with meals. For best results, use consistently as part of a healthy lifestyle with proper hydration.</p>\r\n<p><strong>Quality Assurance:</strong> Made with premium herbs and nutrients. Vegetarian capsules. No artificial additives.</p>",
  "shortDescriptionHtml": "Support liver health and detoxification with New Liver. Advanced formula with Milk Thistle, Artichoke, Dandelion, Chanca Piedra, and Beetroot promotes liver cleanse, fat metabolism, and overall liver function. 60 veggie capsules.",
  "suggestedUse": null,
  "supplementFacts": "Supplement Facts\nServing Size: 2 Veggie Capsules\nServings Per Container: 30\n\nAmount Per Serving / %DV\nZinc (as Zinc Oxide) 30 mg 273%\nCholine (as Choline Bitartrate) 12 mg 2%\nMilk Thistle (Silybum marianum) (seed) 200 mg **\nBeetroot (Beta vulgaris) (root) 50 mg **\nArtichoke Extract (Cynara scolymus) (leaf) 50 mg **\nChanca Piedra Extract (Phyllanthus urinaria L.) (whole plant) 50 mg **\nDandelion (Taraxacum officinale) (root) 50 mg **\nChicory Root (Cichorium intybus L.) 50 mg **\nYarrow (Achillea millefolium) (flower) 50 mg **\nJujube Fruit Extract (Ziziphus jujuba) 50 mg **\nProprietary Blend 512 mg **\nAlfalfa (Medicago sativa) (herb), Burdock Root (Arctium lappa), Celery Seed (Apium graveolens), Feverfew (Tanacetum parthenium) (aerial), Grape Seed Extract (Vitis vinifera L.), Methionine, Yellow Dock (Rumex crispus) (root), Raspberry Juice Powder (Rubus idaeus) (fruit), Turmeric (Curcuma longa) (root), Berberine HCL (Berberis aristata) (bark), Ginger (Zingiber officinale) (root)\n\n** Daily Value (DV) not established\n\nOther Ingredients: Cellulose (Vegetable Capsule), Rice Flour, Magnesium Stearate (Vegetable), Silicon Dioxide.\nDistributed by: successchemistry.com",
  "upc": null,
  "gtin": null,
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  }
}