{
  "sku": "10788-302-1",
  "title": "Colon Cleanse Natural Body Detox Pills by Success Chemistry - Enhance Digestive Health and Detoxification with Psyllium Husk, Senna Leaf, and Aloe Vera - 60 Capsules",
  "slug": "colon-cleanse-natural-body-detox-pills-by-success-chemistry-enhance-digestive-health-and-detoxification-with-psyllium-husk-senna-leaf-and-aloe-vera-60-capsules",
  "descriptionHtml": "Enhance your digestive health and detoxification with <strong>Colon Cleanse Natural Body Detox Pills</strong> by Success Chemistry. Our advanced formula combines powerful natural ingredients known for their colon-cleansing properties, including psyllium husk, senna leaf, and aloe vera. These supplements are designed to help remove toxins from your digestive tract, improve bowel movements, and support overall gut health, ensuring you achieve better digestion and enhanced well-being.\r\r\n\r\r\n<strong>Key Benefits:</strong>\r\r\n<ul>\r\r\n \t<li><strong>Supports Digestive Health:</strong> Promotes regular bowel movements, reducing bloating and discomfort.</li>\r\r\n \t<li><strong>Enhances Detoxification:</strong> Cleanses the colon with natural ingredients, eliminating toxins and waste.</li>\r\r\n \t<li><strong>Improves Gut Health:</strong> Supports a healthy gut environment, promoting beneficial bacteria growth.</li>\r\r\n \t<li><strong>Reduces Bloating and Discomfort:</strong> Aids digestion and detoxification for a more comfortable experience.</li>\r\r\n \t<li><strong>Comprehensive Colon Support:</strong> A holistic approach to colon health and overall wellness.</li>\r\r\n</ul>\r\r\n<strong>Ingredients:</strong>\r\r\n<ul>\r\r\n \t<li><strong>Psyllium Husk:</strong> A natural fiber promoting bowel regularity and toxin removal.</li>\r\r\n \t<li><strong>Senna Leaf:</strong> Known for its laxative properties, supports regular bowel movements.</li>\r\r\n \t<li><strong>Aloe Vera:</strong> Soothes the digestive tract and promotes gut health.</li>\r\r\n \t<li><strong>Chinese Rhubarb:</strong> Supports bowel movements and detoxification.</li>\r\r\n \t<li><strong>Lactobacillus Acidophilus:</strong> A probiotic that supports a healthy gut microbiome.</li>\r\r\n</ul>\r\r\nExperience improved digestive health and detoxification with Colon Cleanse Natural Body Detox Pills by Success Chemistry!\r\r\n<h3></h3>\r\r\nIncorporate Success Chemistry's Colon Cleanse Natural Body Detox Pills into your daily routine to enhance your digestive health and promote detoxification. Experience the comprehensive benefits of our advanced colon cleanse formula and achieve a healthier, more vibrant life naturally.",
  "shortDescriptionHtml": "Enhance digestive health and detoxification with Success Chemistry's Colon Cleanse Natural Body Detox Pills. Our natural formula with psyllium husk, senna leaf, and aloe vera supports colon health and gut function. 60 capsules per bottle.",
  "suggestedUse": null,
  "upc": null,
  "gtin": null,
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 2 Capsules\nServings Per Container: 30\n\nAmount Per Serving / %DV\nCalcium (as Calcium Carbonate) 200 mg 15%\nProprietary Blend 500 mg **\nOat (Avena sativa) (straw), Alfalfa (Medicago sativa) (herb), Psyllium (Plantago ovata) (husk), Chinese Rhubarb (Rheum palmatum) (root), Scabrous Gentian (Gentiana scabra Bge) (root), Aloe Vera (Aloe barbadensis) (leaf), Cascara Sagrada (Rhamnus purshiana) (bark), Goldenseal (Hydrastis canadensis) (root), Buckthorn (Rhamnus cathartica) (bark), Bentonite, Lactobacillus acidophilus\n\n** Daily Value (DV) not established.\n\nOther Ingredients: Rice Flour, Hypromellose (vegetable capsule), Magnesium Stearate (vegetable), Silicon Dioxide.\nDistributed by: successchemistry.com"
}