{
  "sku": "10783-501",
  "title": "Horny Goat Weed Supplement for Men & Women by Success Chemistry - Libido Enhancer with Maca Root, Tongkat Ali, L-Arginine, and Ginseng - Boosts Libido, Stamina, and Performance - 60 Capsules",
  "slug": "horny-goat-weed-supplement-for-men-women-by-success-chemistry-libido-enhancer-with-maca-root-tongkat-ali-l-arginine-and-ginseng-boosts-libido-stamina-and-performance-60-capsules",
  "descriptionHtml": "<p><img src=\"https://cdn11.bigcommerce.com/s-3xlzir0ggb/images/stencil/original/image-manager/-opts-horny-goat-16.jpg?t=1721953082\" alt=\"Three bottles of Success Chemistry's Extreme Horny Goat Supplement displayed from the front, back, and side. The front label features a dynamic goat logo, highlighting the '9 Unisex Enhancers' and '60 Capsules' details. The back label includes supplement facts, directions, and cautionary notes, emphasizing high-quality ingredients for libido and stamina enhancement.\" width=\"1030\" height=\"773\" /><br />Unlock your potential with our Horny Goat Weed Supplement by Success Chemistry, a powerful blend of natural ingredients designed to boost libido, stamina, and overall performance for both men and women. Each serving delivers 1000 mg of Horny Goat Weed (Epimedium sagittatum), known for enhancing sexual health, alongside 250 mg of Maca Root Powder for increased energy and vitality. Our advanced formula includes 100 mg of Tongkat Ali Root Powder and 100 mg of Saw Palmetto Berry Powder to support hormonal balance and prostate health. Additionally, the supplement features Mucuna Pruriens for mood enhancement, Polypodium Vulgare for immune support, and L-Arginine for improved blood flow. Panax Ginseng Root Powder completes this potent blend, promoting physical endurance and mental clarity.</p> <h3><span style=\"font-family: helvetica, arial, sans-serif; color: #000080;\">Key Benefits of Horny Goat Weed Supplement</span></h3> <ul> <li><strong>Boosts Libido and Stamina:</strong> Natural ingredients like Horny Goat Weed and Maca Root enhance sexual desire and improve stamina.</li> <li><strong>Enhances Performance:</strong> L-Arginine and Panax Ginseng support blood flow and physical endurance, ensuring better performance.</li> <li><strong>Supports Hormonal Balance:</strong> Tongkat Ali and Saw Palmetto help maintain hormonal balance and support prostate health.</li> <li><strong>Improves Mood and Vitality:</strong> Mucuna Pruriens and Polypodium Vulgare contribute to better mood and overall vitality.</li> <li><strong>Comprehensive Health Support:</strong> Provides a holistic approach to enhancing sexual health and overall well-being.</li> </ul> <h3><span style=\"font-family: helvetica, arial, sans-serif; color: #000080;\">Ingredients</span></h3> <ul> <li><strong>Epimedium Extract (Horny Goat Weed) (Epimedium sagittatum) (aerial) (100mg of Icariins) - 1000 mg:</strong> Known for boosting libido and improving sexual health.</li> <li><strong>Maca Powder (Lepidium meyenii) (root) - 250 mg:</strong> Increases energy, stamina, and sexual desire.</li> <li><strong>Velvet Bean (Mucuna pruriens) (seed) (15% L-Dopa) - 30 mg:</strong> Enhances mood and supports overall vitality.</li> <li><strong>Polypody Powder (Polypodium vulgare) (fruit) - 20 mg:</strong> Provides immune support.</li> <li><strong>Longjack Powder (Tongkat Ali) (Eurycoma longifolia) (root) - 100 mg:</strong> Supports hormonal balance and enhances libido.</li> <li><strong>Saw Palmetto Powder (Serenoa repens) (fruit) - 100 mg:</strong> Promotes prostate health and hormonal balance.</li> <li><strong>Muira Puama Powder (Ptychopetalum olacoides) (root) - 20 mg:</strong> Enhances sexual desire and performance.</li> <li><strong>L-Arginine (Base) - 20 mg:</strong> Improves blood flow and supports physical performance.</li> <li><strong>Asian Ginseng Powder (Panax ginseng) (root) - 20 mg:</strong> Boosts energy, physical endurance, and mental clarity.</li> </ul> <p><img src=\"https://cdn11.bigcommerce.com/s-3xlzir0ggb/images/stencil/original/image-manager/888-gopze.jpg?t=1721953141\" alt=\"Full label for Success Chemistry's Extreme Horny Goat Supplement, showing suggested use, ingredients, and product details. The label prominently features the goat logo, mountain imagery, and a list of key ingredients like Horny Goat Weed, Maca Root, and L-Arginine, designed to boost libido and performance.\" width=\"1030\" height=\"429\" /></p> <h3><span style=\"font-family: helvetica, arial, sans-serif; color: #000080;\">Unlock Your Potential Naturally</span></h3> <p>Incorporate Success Chemistry's Horny Goat Weed Supplement into your daily routine to boost your libido, enhance stamina, and improve overall performance. Experience the comprehensive benefits of our advanced sexual health formula and unlock your full potential naturally.</p>",
  "shortDescriptionHtml": "Boost your libido and enhance performance with Success Chemistry's Horny Goat Weed Supplement. Our formula includes Maca Root, Tongkat Ali, L-Arginine, and Ginseng for improved stamina and overall sexual health. 60 capsules per bottle.",
  "suggestedUse": null,
  "upc": null,
  "gtin": null,
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 2 Capsules\nServings Per Container: 30\n\nAmount Per Serving / %DV\nHorny Goat Weed (Epimedium sagittatum) Extract (aerial plant) (100mg of Icarins) 1000 mg **\nMaca Root Powder (Lepidium meyenii) 250 mg **\nMucuna Pruriens (seed) 15% L-Dopa 30 mg **\nPolypodium Vulgare Powder (herb) 20 mg **\nTongkat Ali Root Powder (Eurycoma longifolia) 100 mg **\nSaw Palmetto Berry Powder (Serenoa repens) 100 mg **\nMuira Puama Root Powder (Ptychopetalum olacoides) 20 mg **\nL-Arginine HCL (Base) 20 mg **\nPanax Ginseng Root Powder 20 mg **\n\n**Daily Value (DV) not established\n\nOther Ingredients: Gelatin Capsule, Rice Flour, Vegetable Magnesium Stearate.\nDistributed by: successchemistry.com"
}