{
  "sku": "14179-504",
  "title": "Success Chemistry Prostate Renew - A blend of Saw Palmetto, Quercetin, and Juniper, traditionally used to assist with urinary function and well-being. Each bottle contains 60 veggie capsules.",
  "slug": "success-chemistry-prostate-renew-a-blend-of-saw-palmetto-quercetin-and-juniper-traditionally-used-to-assist-with-urinary-function-and-well-being-each-bottle-contains-60-veggie-capsules",
  "descriptionHtml": "<strong>Support your prostate health</strong> with Success Chemistry Prostate Renew, formulated for men's wellness. This blend features Saw Palmetto, Quercetin, and other natural ingredients traditionally used to help maintain urinary function and prostate health.\r\r\n\r\r\n<strong>Key Ingredients:</strong>\r\r\n<ul>\r\r\n \t<li><strong>Saw Palmetto:</strong> Traditionally supports urinary function and prostate health.</li>\r\r\n \t<li><strong>Quercetin:</strong> An antioxidant that helps maintain a healthy inflammatory response.</li>\r\r\n \t<li><strong>Juniper &amp; Uva Ursi:</strong> Assist in urinary function and detox support.</li>\r\r\n</ul>\r\r\n<h3><span style=\"color: #000080; font-family: helvetica, arial, sans-serif;\"><strong>Why Choose Success Chemistry Prostate Renew?</strong></span></h3>\r\r\n<ul>\r\r\n \t<li><strong>Supports Urinary Flow:</strong> A natural blend that assists with maintaining healthy urinary flow, helping reduce disruptions during sleep and daily activities.</li>\r\r\n \t<li><strong>Prostate Health Support:</strong> Contains Saw Palmetto and pumpkin seed oil, traditionally used to maintain prostate function.</li>\r\r\n \t<li><strong>Inflammation Support:</strong> Quercetin and burdock root help maintain a healthy inflammatory response.</li>\r\r\n \t<li><strong>Natural and Safe:</strong> Made with high-quality ingredients, free from artificial additives.</li>\r\r\n \t<li><strong>Convenient:</strong> 60 easy-to-swallow veggie capsules, providing a one-month supply.</li>\r\r\n</ul>",
  "shortDescriptionHtml": "Support your prostate and urinary health with Success Chemistry Prostate Renew™. Our formula with Saw Palmetto, quercetin, and natural ingredients promotes better urine flow and fewer bathroom trips. 60 veggie caps per bottle.",
  "suggestedUse": null,
  "upc": null,
  "gtin": null,
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 2 Capsules\nServings Per Container: 30\n\nAmount Per Serving / %DV\nVitamin E (as DL-Alpha Tocopherol Acetate) 13 mg 87%\nVitamin B6 (as Pyridoxine HCL) 2 mg 118%\nZinc (as Zinc Oxide) 12 mg 109%\nSelenium (as Selenium Amino Acid Chelate) 55 mcg 100%\nCopper (as Copper Gluconate) 4 mg 444%\nSaw Palmetto (Serenoa repens) (fruit) 200 mg **\nPygeum africanum Powder (bark) 100 mg **\nPlant Sterol Complex (Glycine max) (seed) 50 mg **\nRaspberry Juice Powder (Rubus idaeus) (fruit) 50 mg **\nGraviola (Annona muricata) (leaf) 50 mg **\nGreen Tea (Camellia sinensis) (leaf) 50 mg **\nCat's Claw (Uncaria tomentosa) (bark) 30 mg **\nBroccoli (Brassica oleracea) (crown) 30 mg **\nTomato Powder (Lycopersicon esculentum) (fruit) 30 mg **\nNettle (Urtica dioica) (root) 30 mg **\nMaitake (Polyporus frondosus) (fruit) 10 mg **\nReishi (Ganoderma lucidum) (fruit) 10 mg **\nShiitake (Lentinus edodes) (fruit) 10 mg **\nProprietary Blend 176 mg **\nQuercetin (Sophora japonica) (bud), Juniper (Juniperus communis) (fruit), Uva Ursi (Arctostaphylos pungens) (leaves), Buchu (Agathosma betulina) (leaves), L-Alanine, L-Glycine, Pumpkin Seed (Cucurbita pepo) (seeds), Burdock (Arctium lappa) (root), Cayenne (Capsicum annuum) (fruit), Goldenseal (Hydrastis canadensis) (root), Marshmallow (Althaea officinalis) (root), Parsley (Petroselinum crispum) (stem and leaf)\n\n** Daily Value (DV) not established\n\nInactive Ingredients: Cellulose (Vegetable Capsule), Rice Flour, Magnesium Stearate (Vegetable), Silicon Dioxide. Contains: Soy.\nDistributed by: successchemistry.com"
}