{
  "sku": "1994-807-1",
  "title": "EyesWhite - Eye Whitening Supplement for Bright, Radiant Eyes",
  "slug": "eyeswhite-eye-whitening-supplement-for-bright-radiant-eyes",
  "descriptionHtml": "Illuminate your gaze with EyesWhite, the premier eye whitening supplement designed to enhance the beauty of your eyes. Formulated with a potent blend of natural ingredients, EyesWhite promotes eye brightness, whitening, and detoxification. Lutein supports eye health and shields against oxidative stress, promoting a vibrant appearance. N-Acetyl Cysteine detoxifies and rejuvenates, combating environmental pollutants for clearer eyes. Bilberry Extract enhances microcirculation, contributing to luminous eyes. Alpha Lipoic Acid acts as a powerful antioxidant, brightening tired eyes.\r\r\n\r\r\nEnhance your vision and maintain eye health with our Eye-Whitening Vitamin Supplement, specially formulated with Eyebright and Lutein. These powerful ingredients work together to support natural eye care, reduce eye strain, and promote clearer, whiter eyes. Eyebright, known for its anti-inflammatory properties, helps soothe tired eyes, while Lutein, a carotenoid, protects against harmful blue light and oxidative stress. Perfect for those spending long hours in front of screens, this supplement ensures your eyes stay healthy and bright. Improve your eye health naturally with our premium supplement. Illuminate your gaze with EyesWhite and reveal vibrant, detoxified eyes that reflect true beauty.",
  "shortDescriptionHtml": "Enhance your eye beauty with EyesWhite Eye Beauty Supplement. Packed with natural ingredients like Biotin, Eyebright, Lutein, and Grape Seed, it supports white sclera, prevents degeneration, and enhances vision. Perfect for maintaining bright, healthy eyes naturally.",
  "suggestedUse": null,
  "upc": null,
  "gtin": null,
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 2 Capsules\nServings Per Container: 30\n\nAmount Per Serving / %DV\nVitamin A (as Beta-carotene) 100 mcg RAE 11%\nVitamin C (as Ascorbic acid) 200 mg 222%\nVitamin E (DL-Alpha tocopheryl acetate) 20 mg 133%\nThiamin (as Thiamine mononitrate) 8 mg 667%\nRiboflavin (as B2) 8 mg 615%\nNiacin (as Niacin) 40 mg NE 250%\nVitamin B12 (as Cyanocobalamin) 27 mcg 1,125%\nCalcium (as Calcium carbonate) 50 mg 4%\nBiotin 800 mcg 2,667%\nMagnesium (as Magnesium oxide) 40 mg 10%\nZinc (as Zinc oxide) 32 mg 291%\nSelenium (as Selenium Amino Acid Chelate) 8 mcg 15%\nCopper (as Copper gluconate) 2 mg 222%\nChromium (as Chromium picolinate) 3.6 mcg **\nProprietary Blend 481 mg **\nLutein (Tagetes erecta L.) (flower), Bilberry Extract (Vaccinium myrtillus) (fruit), Alpha Lipoic Acid (ALA), Eyebright (Euphrasia officinalis L.) (whole plant), Zeaxanthin (Tagetes erecta L.) (flower), Quercetin (Sophora japonica) (bud), Rutin (Sophora japonica L.) (flower), L-Taurine, Grape Extract (Vitis vinifera L.) (seed), Lycopene (Lycopersicon esculentum) (fruit)\n\n** Daily Value (DV) not established.\n\nOther Ingredients: Rice Flour, Hypromellose (vegetable capsule), Vegetable Stearate, Silicon Dioxide.\nDistributed by: successchemistry.com"
}