{
  "sku": "20646-838",
  "title": "Mushroom Immune Aid and Lung Health Immunity - Boost Your Immune System and Lung Function with Medicinal Mushrooms - Reishi, Cordyceps, Chaga, and More - Natural Ingredients for Respiratory Health and Overall Well-being - 60 Servings",
  "slug": "mushroom-immune-aid-and-lung-health-immunity-boost-your-immune-system-and-lung-function-with-medicinal-mushrooms-reishi-cordyceps-chaga-and-more-natural-ingredients-for-respiratory-health-and",
  "descriptionHtml": "<div class=\"flex flex-grow flex-col max-w-full\">\r\r\n<div class=\"min-h-[20px] text-message flex w-full flex-col items-end gap-2 whitespace-pre-wrap break-words [.text-message+&amp;]:mt-5 overflow-x-auto\" dir=\"auto\" data-message-author-role=\"assistant\" data-message-id=\"811c4e99-732d-40a6-9690-8693c4e2b903\">\r\r\n<div class=\"flex w-full flex-col gap-1 empty:hidden first:pt-[3px]\">\r\r\n<div class=\"markdown prose w-full break-words dark:prose-invert dark\">\r\r\n\r\r\nBoost your immune system and respiratory health with New Lung® Mushroom Immune Aid and Lung Health Immunity. This unique formula combines a powerful blend of medicinal mushrooms known for their immune-supporting properties, including Organic Reishi, Cordyceps, and Chaga. These mushrooms are renowned for enhancing lung function, improving oxygen uptake, and supporting overall immune health. Ideal for anyone looking to strengthen their immune system and protect their respiratory health, this supplement provides comprehensive support for overall well-being.\r\r\n\r\r\n&nbsp;\r\r\n\r\r\n<span style=\"font-family: helvetica, arial, sans-serif; color: #000080;\"><strong>Key Ingredients and Their Benefits</strong></span>\r\r\n<ul>\r\r\n \t<li><strong>Organic Reishi Mushroom (Ganoderma lucidum):</strong> Known as the \"mushroom of immortality,\" Reishi supports immune function, reduces inflammation, and promotes respiratory health.</li>\r\r\n \t<li><strong>Organic Cordyceps Extract (Cordyceps militaris):</strong> Cordyceps enhances lung function, increases oxygen uptake, and boosts energy levels, making it ideal for respiratory support.</li>\r\r\n \t<li><strong>Organic Turkey Tail Extract (Coriolus versicolor):</strong> Rich in polysaccharides, Turkey Tail supports immune health and has been used for centuries to promote overall wellness.</li>\r\r\n \t<li><strong>Organic Shiitake Extract (Lentinus edodes):</strong> Shiitake mushrooms are packed with antioxidants and support immune function and cardiovascular health.</li>\r\r\n \t<li><strong>Organic Lion’s Mane Extract (Hericium erinaceus):</strong> Known for its neuroprotective properties, Lion’s Mane also supports immune function and overall health.</li>\r\r\n \t<li><strong>Organic Maitake Extract (Grifola frondosa):</strong> Maitake mushrooms support immune function and help regulate blood sugar levels.</li>\r\r\n \t<li><strong>Organic Chaga Extract (Inonotus obliquus):</strong> Chaga is rich in antioxidants and supports immune health, reducing oxidative stress.</li>\r\r\n \t<li><strong>Organic Agaricus Blazei Extract (Agaricus blazei murill):</strong> Known for its immune-boosting properties, Agaricus Blazei helps support overall health and well-being.</li>\r\r\n</ul>\r\r\n<h3><span style=\"font-family: helvetica, arial, sans-serif; color: #000080;\"><strong>Herbal Adaptogen Blend</strong></span></h3>\r\r\n<ul>\r\r\n \t<li><strong>Organic Ashwagandha (Withania somnifera):</strong> An adaptogen that helps reduce stress and supports immune function.</li>\r\r\n \t<li><strong>Organic Asian Ginseng (Panax ginseng):</strong> Ginseng boosts energy, supports immune function, and enhances physical performance.</li>\r\r\n \t<li><strong>Organic Rhodiola (Rhodiola rosea):</strong> Known for its adaptogenic properties, Rhodiola supports stress reduction and enhances immune function</li>\r\r\n</ul>\r\r\n<h3><span style=\"font-family: helvetica, arial, sans-serif; color: #000080;\"><strong>Enhance Your Immunity and Lung Health Naturally</strong></span></h3>\r\r\nIncorporate New Lung® Mushroom Immune Aid and Lung Health Immunity into your daily routine for enhanced respiratory health and overall well-being. Our advanced formula provides the essential support your body needs to maintain a strong immune system and healthy lungs. Experience the benefits of medicinal mushrooms and natural ingredients designed to promote optimal health.\r\r\n\r\r\n</div>\r\r\n</div>\r\r\n</div>\r\r\n</div>",
  "shortDescriptionHtml": "Boost your immune system and lung function with New Lung¬Æ Mushroom Immune Aid. Our unique formula with Reishi, Cordyceps, Chaga, and more supports respiratory health and overall well-being. 60 servings per container.",
  "suggestedUse": null,
  "upc": null,
  "gtin": null,
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 2 Capsules\nServings Per Container: 30\n\nAmount Per Serving / %DV\nCordyceps Powder (Cordyceps sinensis) (Mycelium) 266 mg **\nReishi Mushroom Extract (Ganoderma lucidum) (fruiting bodies) 266 mg **\nShiitake Mushroom Extract (Lentinus edodes) (fruiting bodies) 266 mg **\nLions Mane (Hericium erinaceus) (fruiting bodies) 266 mg **\nProprietary Blend 266 mg **\nMaitake Mushroom Extract (Polyporus frondosus) (fruiting bodies), Turkey Tails (Coriolus versicolor) (fruiting bodies), Chaga Mushroom Extract (Inonotus obliquus) (fruiting bodies), Royal Sun Agaricus Extract (Agaricus blazei) (fruiting bodies), White Button Mushroom Extract (Agaricus bisporus) (fruiting bodies), Wood Ear Fungus Extract (Auricularia auricula) (fruiting bodies)\n\n**Daily Value (DV) not established\n\nOther Ingredients: Hypromellose (vegetable capsule), Microcrystalline Cellulose, Magnesium Stearate.\nDistributed by: successchemistry.com"
}