{
  "sku": "5531-502",
  "title": "Perfect Yoni Organic Women's Probiotic - Vaginal Health Supplement | Perfect Yoni - 60 Capsules of Probiotics for Women",
  "slug": "perfect-yoni-organic-womens-probiotic-vaginal-health-supplement-perfect-yoni-60-capsules-of-probiotics-for-women",
  "descriptionHtml": "<strong>\r\r\nPERFECT YONI</strong> Feminine <strong>PH</strong> balance\r\r\nPerfect Yoni Organic Women's Probiotic combines a powerful proprietary blend of natural, organic ingredients designed to promote a balanced vaginal flora, support yeast levels, and maintain healthy pH balance. Free from artificial additives, this supplement is tailored to support optimal vaginal health and overall wellness. The unique blend of herbs, extracts, and nutrients works synergistically to stabilize vaginal health and restore natural balance.\r\r\n\r\r\nVaginal Health Supplement\r\r\n\r\r\nProprietary Blend (745mg):\r\r\nPumpkin Extract (Semen moschatae - Seed):\r\r\nKnown for its antioxidant properties, Pumpkin Seed Extract is rich in nutrients that support overall immunity and digestive health. It also plays a role in maintaining hormonal balance, essential for vaginal health.\r\r\n\r\r\nSarsaparilla Extract (Smilax china L. - Root):\r\r\nSarsaparilla has traditionally been used to detoxify the body and improve circulation. It’s often linked to supporting hormonal balance and reducing inflammation in the body, which can impact vaginal health.\r\r\n\r\r\nMuira Puama Extract (Ptychopetalum olacoides - Bark):\r\r\nMuira Puama is a potent adaptogen known for its ability to support sexual health and energy levels. It has also been linked to enhanced libido and hormone regulation, beneficial for vaginal wellness.\r\r\n\r\r\nOat Straw Extract (Avena sativa L. - Straw):\r\r\nOat Straw is known for its soothing and anti-inflammatory properties. It also supports healthy blood flow, which can improve overall tissue health, including the delicate tissues of the vaginal area.\r\r\n\r\r\nBoron (Amino Acid Chelate):\r\r\nBoron is a trace mineral that plays an essential role in maintaining bone health, but it’s also believed to regulate estrogen levels, supporting vaginal health and hormone balance.\r\r\n\r\r\nCayenne Pepper Extract (Capsicum annuum - Fruit):\r\r\nCayenne Pepper is well-known for its ability to improve circulation and metabolism. It may also help in promoting a healthy pH balance, which is essential for vaginal health and preventing odor.\r\r\n\r\r\nCatuaba Extract (Erythroxylum catuaba - Bark):\r\r\nCatuaba is an Amazonian herb traditionally used to support the nervous system and increase energy. It is also believed to help with hormone regulation and improving overall sexual health.\r\r\n\r\r\nLicorice Extract (Glycyrrhiza uralensis - Root):\r\r\nLicorice has powerful anti-inflammatory and anti-bacterial properties. It can help soothe irritated tissues and balance the vaginal microbiome, reducing the risk of infections and promoting healthy flora.\r\r\n\r\r\nTribulus Terrestris (Whole Herb):\r\r\nThis herb is commonly used to support healthy hormone levels and sexual function. It may help balance female hormones, which is crucial for maintaining vaginal health.\r\r\n\r\r\nOrchic (Substance):\r\r\nOrchic is derived from testicular extract, believed to support overall vitality and hormone balance. It’s typically used to boost reproductive health and improve energy levels.\r\r\n\r\r\nOyster Extract:\r\r\nRich in zinc, Oyster Extract supports immune function and plays a role in hormone regulation, which is important for maintaining vaginal health and fertility.\r\r\n\r\r\nAstragalus Extract (Astragalus membranaceus - Root):\r\r\nKnown for its immune-boosting properties, Astragalus helps enhance the body’s defense systems, which supports overall health, including the delicate balance of the vaginal flora.\r\r\n\r\r\nNettle Extract (Urtica dioica):\r\r\nNettle is packed with vitamins and minerals that help nourish and support the body. It is often used for its anti-inflammatory effects and to promote a healthy urinary tract and hormone balance.",
  "shortDescriptionHtml": "Support vaginal health and pH balance with Perfect Yoni Organic Women's Probiotic. Powerful blend with Tongkat Ali, Maca, L-Arginine, Ginseng, and proprietary herbal formula promotes feminine wellness and hormonal balance. 60 capsules.",
  "suggestedUse": null,
  "upc": "645080279443",
  "gtin": "645080279443",
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 2 Tablets\nServings Per Container: 30\n\nAmount Per Serving / %DV\nCalcium (as Calcium Carbonate) 367 mg 28%\nZinc (as Zinc Oxide) 50 mg 455%\nTongkat Ali (Eurycoma longifolia) (root) 400 mg †\nMaca (Lepidium meyenii) (root) 250 mg †\nL-Arginine 250 mg †\nGinseng Eleutherococcus Blend 125 mg †\n[Panax ginseng (root)] [Eleutherococcus senticosus (root)]\nProprietary Blend 745 mg †\nPumpkin Extract (Semen moschatae) (seed), Sarsaparilla Extract (Smilax china L.) (root), Muira Puama Extract (Ptychopetalum olacoides) (bark), Oat Straw (Avena sativa L.) (straw), Boron (Amino acid chelate), Cayenne Pepper (Capsicum annuum) (fruit), Catuaba (Erythroxylum catuaba) (bark), Licorice Extract (Glycyrrhiza uralensis) (root), Tribulus terrestris (Whole herb), Orchic (substance), Oyster Extract, Astragalus Extract (Astragalus membranaceus) (root), Nettle Extract (Urtica dioica L.) (leaf).\n\n† Daily Value (DV) not established\n\nOther Ingredients: Vegetable Stearic Acid, Vegetable Magnesium Stearate, Silicon Dioxide.\nDistributed by: successchemistry.com"
}