{
  "sku": "B072MMW71X-1",
  "title": "Hair La Fluer Maximum, Hair Growth, Island formulation with Horsetail, Bamboo and Peony extract",
  "slug": "hair-la-fluer-maximum-hair-growth-island-formulation-with-horsetail-bamboo-and-peony-extract",
  "descriptionHtml": "<div><img class=\"alignleft size-full wp-image-2070\" src=\"https://successchemistry.com/wp-content/uploads/2025/09/4ac8a1d7-031f-43a0-a831-add30ed77923._CR00970600_PT0_SX970__.jpg\" alt=\"\" width=\"970\" height=\"600\" /></div>\r\r\n<div class=\"expand-collapse-content dangerous-html w_YUC7\">★ HIGH POTENCY PROPRIETARY BLEND SUPPLEMENT With 20+ FAST Absorbing Ingredients - Enhanced 5000 mcg Biotin, Horsetail Extract, Saw Palmetto, Bamboo Extract, Collagen And Other Natural Ingredients To Promote Natural Growth Of Existing Hair.</div>\r\r\n<div></div>\r\r\n<div class=\"expand-collapse-content dangerous-html w_YUC7\">★ THICKER Hair that REGROWS at MAX Speed ALSO - Most customers find that while it may take a few weeks of consistent use for significant changes in your hair to be visible, the benefits to your skin and nails will be much faster. You'll enjoy nourished, moisturized skin and healthier, stronger nails while your hair is growing faster, fuller, and healthier from the roots.</div>\r\r\n<div></div>\r\r\n<div class=\"expand-collapse-content dangerous-html w_YUC7\">★ DHT BLOCKER - When it comes to treatments that give great results, these Hair Growth capsules come packed with natural DHT blocking properties that do the trick by stopping DHT levels from producing to serve as the ultimate prevention for hair pattern baldness for adults.</div>\r\r\n<div></div>\r\r\n<div class=\"expand-collapse-content dangerous-html w_YUC7\">★ BEAT BALDNESS - Our unique blend has ingredients that you will not get anywhere else.</div>\r\r\n<div></div>\r\r\n<div class=\"expand-collapse-content dangerous-html w_YUC7\">★ PURITY - We use only the finest ingredients, all of which are manufactured in our US, GMP compliant, state-of-the-art, facility. Every batch is laboratory tested for quality assurance. OUR GUARANTEE: We're very so confident that you'll love this product that we offer a 60-day, 100% money-back guarantee.</div>\r\r\n&nbsp;",
  "shortDescriptionHtml": "Promote maximum hair growth with Hair La Fleur. High-potency formula with 5000mcg Biotin, Horsetail Extract, Bamboo, Saw Palmetto, and DHT blockers supports thicker, fuller hair regrowth. Benefits skin and nails too. 60 capsules.",
  "suggestedUse": null,
  "upc": "651538085516",
  "gtin": "651538085516",
  "weightOz": 3,
  "sizeInches": {
    "width": 2,
    "height": 3.5
  },
  "supplementFacts": "Supplement Facts\nServing Size: 2 Capsules\nServings Per Container: 30\n\nAmount Per Serving / %DV\nVitamin A 2400 IU 48%\nVitamin C 120 mg 200%\nCalcium Carbonate 80 mg 1%\nIron Ferrous Fumarate 14.5 mg 80%\nVitamin D3 800 IU 200%\nVitamin E 30 IU 100%\nVitamin B1 6 mg 400%\nVitamin B6 8 mg 400%\nFolic Acid 880 ug 220%\nVitamin B12 12 ug 200%\nBiotin 600 ug 200%\nVitamin B5 30 mg 300%\nMagnesium Oxide 120 mg 30%\nZinc oxide 7.2 mg 48%\nManganese chelate 4 mg 200%\nPotassium gluconate 12 mg 1%\nProprietary Blend: 409 mg **\nPABA, L-Tyrosine, Horsetail extract, Fo-Ti, Bamboo extract, Nettle root, Peony, Spirulina, Saw palmetto, Plant sterols, Alfalfa, Barley grass\n\n** Daily Value (DV) Not Established\n\nInactive Ingredients: Cellulose (Vegetable Capsule), Rice Flour, Magnesium stearate, Silicon dioxide.\nDistributed by: successchemistry.com"
}